redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_usbdev.c
 *
 *   Copyright (C) 2009-2013 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.orgr>
 *   Copyright (C) 2018 Zglue Inc. All rights reserved.
 *   Author: Levin Li <zhiqiang@zglue.com>
 *
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/kthread.h>

#include "nvic.h"
#include "cache.h"
#include "chip.h"
#include "up_arch.h"
#include "up_internal.h"

#include "nrf.h"
#include "nrf_usbd.h"
#include "nrfx_usbd_errata.h"
#include "nrf52_usbdev.h"
#include "nrf52_power.h"
#include "nrf52_clock.h"

#if defined(CONFIG_USBDEV) && defined(CONFIG_NRF52_USBD)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
//#define nrf52_trace    uwarn
#define nrf52_trace    uinfo

/* Configuration ************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#endif

#ifndef CONFIG_USB_PRI
#define CONFIG_USB_PRI NVIC_SYSH_MAXNORMAL_PRIORITY
#endif

/* Extremely detailed register debug that you would normally never want
 * enabled.
 */

#ifndef CONFIG_DEBUG_USB_INFO
#undef CONFIG_NRF52_USBDEV_REGDEBUG
#endif


/* Endpoint identifiers. The NRF52 supports up to 18 mono-directional or 9
 * bidirectional endpoints. The fact that EP0 is bidirectional, then there is
 * 2 control (1 IN , 1 OUT), 14 bulk/interrupt (7 IN , 7 OUT) and
 * 2 ISO (1 IN, 1 OUT) endpoints
 * a functional limitation of EP0 + 7 bi-directional endpoints + ISO = 9.
 * We'll define NRF52_NENDPOINTS to be 18 for generic EP.
 * 0 is for special ctrl, 8 is for special isoc
 * however, because that is how many
 * endpoint register sets there are.
 */

/* they are spitted into 9 end point group
 * 0,1 | 1,2 | 3,4 | 5,6 | 7,8 |......
 * EP0 | EP1 | EP2 | EP3 | EP4 |......
 */
#define NRF52_NENDPOINTS      (NRF_USBD_EPOUT_CNT + NRF_USBD_EPIN_CNT)

#define EP0                   0
#define EP0_OUT               0
#define EP0_IN                1
#define EPISOC                8

#define NRF52_ENDP_BIT(ep)    (1 << (ep))
#define NRF52_ENDP_ALLSET     (0x3FFFF)

/* Packet sizes.  We us a fixed 64 max packet size for all bulk endpoint types */

#define NRF52_MAXPACKET_SHIFT (6)
#define NRF52_MAXPACKET_SIZE  (1 << (NRF52_MAXPACKET_SHIFT))
#define NRF52_MAXPACKET_MASK  (NRF52_MAXPACKET_SIZE-1)

#define NRF52_EP0MAXPACKET    NRF52_MAXPACKET_SIZE

#define NRF52_EP8MAXPACKET    512

/* USB-related masks */

#define REQRECIPIENT_MASK     (USB_REQ_TYPE_MASK | USB_REQ_RECIPIENT_MASK)

#define NRF52_USBD_INT_ALL_MASK  (0xFFFFFFFFUL)


/* Request queue operations *************************************************/

#define nrf52_reqempty(ep)     ((ep)->head == NULL)
#define nrf52_reqpeek(ep)      ((ep)->head)

/* USB trace ****************************************************************/
/* Trace error codes */

#define NRF52_TRACEERR_ALLOCFAIL            0x0001
#define NRF52_TRACEERR_BADCLEARFEATURE      0x0002
#define NRF52_TRACEERR_BADDEVGETSTATUS      0x0003
#define NRF52_TRACEERR_BADEPGETSTATUS       0x0004
#define NRF52_TRACEERR_BADEPNO              0x0005
#define NRF52_TRACEERR_BADEPTYPE            0x0006
#define NRF52_TRACEERR_BADGETCONFIG         0x0007
#define NRF52_TRACEERR_BADGETSETDESC        0x0008
#define NRF52_TRACEERR_BADGETSTATUS         0x0009
#define NRF52_TRACEERR_BADSETADDRESS        0x000a
#define NRF52_TRACEERR_BADSETCONFIG         0x000b
#define NRF52_TRACEERR_BADSETFEATURE        0x000c
#define NRF52_TRACEERR_BINDFAILED           0x000d
#define NRF52_TRACEERR_DISPATCHSTALL        0x000e
#define NRF52_TRACEERR_DRIVER               0x000f
#define NRF52_TRACEERR_DRIVERREGISTERED     0x0010
#define NRF52_TRACEERR_EP0BADCTR            0x0011
#define NRF52_TRACEERR_EP0SETUPSTALLED      0x0012
#define NRF52_TRACEERR_EPBUFFER             0x0013
#define NRF52_TRACEERR_EPDISABLED           0x0014
#define NRF52_TRACEERR_EPOUTNULLPACKET      0x0015
#define NRF52_TRACEERR_EPRESERVE            0x0016
#define NRF52_TRACEERR_INVALIDCTRLREQ       0x0017
#define NRF52_TRACEERR_INVALIDPARMS         0x0018
#define NRF52_TRACEERR_IRQREGISTRATION      0x0019
#define NRF52_TRACEERR_NOTCONFIGURED        0x001a
#define NRF52_TRACEERR_REQABORTED           0x001b

/* Trace interrupt codes */

#define NRF52_TRACEINTID_CLEARFEATURE       0x0001
#define NRF52_TRACEINTID_DEVGETSTATUS       0x0002
#define NRF52_TRACEINTID_DISPATCH           0x0003
#define NRF52_TRACEINTID_EP0IN              0x0004
#define NRF52_TRACEINTID_EP0INDONE          0x0005
#define NRF52_TRACEINTID_EP0OUTDONE         0x0006
#define NRF52_TRACEINTID_EP0SETUPDONE       0x0007
#define NRF52_TRACEINTID_EP0SETUPSETADDRESS 0x0008
#define NRF52_TRACEINTID_EPGETSTATUS        0x0009
#define NRF52_TRACEINTID_EPINDONE           0x000a
#define NRF52_TRACEINTID_EPINQEMPTY         0x000b
#define NRF52_TRACEINTID_EPOUTDONE          0x000c
#define NRF52_TRACEINTID_EPOUTPENDING       0x000d
#define NRF52_TRACEINTID_EPOUTQEMPTY        0x000e
#define NRF52_TRACEINTID_ESOF               0x000f
#define NRF52_TRACEINTID_GETCONFIG          0x0010
#define NRF52_TRACEINTID_GETSETDESC         0x0011
#define NRF52_TRACEINTID_GETSETIF           0x0012
#define NRF52_TRACEINTID_GETSTATUS          0x0013
#define NRF52_TRACEINTID_EPINTERRUPT        0x0014
#define NRF52_TRACEINTID_IFGETSTATUS        0x0015
#define NRF52_TRACEINTID_LPCTR              0x0016
#define NRF52_TRACEINTID_RSTINTERRUPT       0x0017
#define NRF52_TRACEINTID_NOSTDREQ           0x0018
#define NRF52_TRACEINTID_RESET              0x0019
#define NRF52_TRACEINTID_SETCONFIG          0x001a
#define NRF52_TRACEINTID_SETFEATURE         0x001b
#define NRF52_TRACEINTID_SUSP               0x001c
#define NRF52_TRACEINTID_SYNCHFRAME         0x001d
#define NRF52_TRACEINTID_WKUP               0x001e
#define NRF52_TRACEINTID_EP0SETUPOUT        0x001f
#define NRF52_TRACEINTID_EP0SETUPOUTDATA    0x0020
#define NRF52_TRACEINTID_SETADDR            0x0021

/****************************************************************************
 * Private Type Definitions
 ****************************************************************************/

/* The various states of a control pipe */

enum nrf52_ep0state_e
{
  EP0STATE_IDLE = 0,        /* No request in progress */
  EP0STATE_RESPONSE,        /* response setup data */
  EP0STATE_SETUP_OUT,       /* Set up recived with data for device OUT in progress */
  EP0STATE_SETUP_READY,     /* Set up was recived prior and is in ctrl,
                             * now the data has arrived */
  EP0STATE_WRREQUEST,       /* Write request in progress */
  EP0STATE_RDREQUEST,       /* Read request in progress */
  EP0STATE_STALLED          /* We are stalled */
};

