redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
/* Resume states */

enum nrf52_rsmstate_e
{
  RSMSTATE_IDLE = 0,        /* Device is either fully suspended or running */
  RSMSTATE_STARTED,         /* Resume sequence has been started */
  RSMSTATE_WAITING          /* Waiting (on ESOFs) for end of sequence */
};

union wb_u
{
  uint16_t w;
  uint8_t  b[2];
};

/* A container for a request so that the request make be retained in a list */

struct nrf52_req_s
{
  struct usbdev_req_s    req;           /* Standard USB request */
  struct nrf52_req_s    *flink;         /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct nrf52_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct nrf52_ep_s.
   */

  struct usbdev_ep_s     ep;            /* Standard endpoint structure */

  /* NRF52-specific fields */

  struct nrf52_usbdev_s *dev;           /* Reference to private driver data */
  struct nrf52_req_s    *head;          /* Request list for this endpoint */
  struct nrf52_req_s    *tail;
  uint8_t                eppos;         /* EP position in eplist */
  uint8_t                eptype;        /* USB_EP_ATTR_XFER_INT | BULK | ISOC */
  uint8_t                stalled: 1;    /* true: Endpoint is stalled */
  uint8_t                busy: 1;       /* true: endpoint is transfering */
  uint8_t                txnullpkt: 1;  /* Null packet needed at end of transfer */
  uint8_t                xfer: 1;       /* true: need to update xfer point */
  uint16_t               req_len;       /* the out transaction length from host */
};

/*
 * only PWR_READY , Suspend , resume can access usbd register
 */
enum phy_status
{
  NRF52_USBPHY_STATUS_UNINIT = 0,
  NRF52_USBPHY_STATUS_INITIALIZED,
  NRF52_USBPHY_STATUS_DETECT,  /* VBUS is ready to enable USBD Phy */
  NRF52_USBPHY_STATUS_REMOVE,  /* VBUS is lost, USBD should be disabled under this event */
  NRF52_USBPHY_STATUS_PWR_READY, /* PWR is ready to enable usbd on usb bus (pullup) */
  NRF52_USBPHY_STATUS_SUSPEND,
  NRF52_USBPHY_STATUS_RESUME,
};

enum ep_status
{
  NRF52_EP_STATUS_IDLE = 0,
  NRF52_EP_STATUS_INPROGRESS,
};

enum phy_connect
{
  NRF52_DEV_DISCONNECT = 0,     /* pull up  is not set */
  NRF52_DEV_CONNECTED,       /* pullup is set */
  NRF52_DEV_CONNECTING,     /* pullup is waiting to setup */
};

struct nrf52_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s
   * to structnrf52_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* NRF52-specific fields */

  /* indicate the phy status , only one EP transfer for one time */
  enum ep_status         epstatus;

  uint8_t                ep0dir;        /*true : in ; false : out*/
  uint8_t                ep0state;      /* State of EP0 (see enum nrf52_ep0state_e) */
  uint8_t                rsmstate;      /* Resume state (see enum nrf52_rsmstate_e) */
  uint8_t                nesofs;        /* ESOF counter (for resume support) */
  uint8_t                selfpowered: 1; /* 1: Device is self powered */
  uint8_t                response: 1;   /* 1: indicate there is response data for setup */
  enum phy_status        phystatus;     /* usb phy power status */
  enum phy_connect       connect;       /* usb phy power status */
  uint32_t               epavail;       /* Bitset of available endpoints */
  uint32_t               imask;         /* Current interrupt mask */

  /* E0 SETUP data buffering.
   *
   * ctrl
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data
   *   For OUT SETUP requests, the SETUP data phase must also complete before
   *   the SETUP command can be processed.  The ep0 packet receipt logic
   *   nrf52_ep0_rdrequest will save the accompanying EP0 OUT data in
   *   ep0data[] before the SETUP command is re-processed.
   *
   * ep0datlen
   *   Lenght of OUT DATA received in ep0data[]
   */

  struct usb_ctrlreq_s   ctrl;          /* Last EP0 request */

  uint8_t                ep0data[CONFIG_USBDEV_SETUP_MAXDATASIZE];
  uint16_t               ep0datalen;

  /* The endpoint list */
  struct nrf52_ep_s      eplist[NRF52_NENDPOINTS];
  pthread_t              monitor;
  sem_t                  sem;
  uint32_t               out_pack;  /* debug : OUT package number except ctrl */
  uint32_t               out_cnt;
  uint32_t               in_pack;   /* debug : IN package number except ctrl */
  uint32_t               in_cnt;
};

/* epdatastatus : bit 23...17  out;  bit 7...2 in */
#define NRF52_EPOUT_DONE_MASK   0xFE0000UL
#define NRF52_EPIN_DONE_MASK    0xFE

#define NRF52_DEFAULT_INT      ( NRF_USBD_INT_USBRESET_MASK     | \
                                 0      | \
                                 NRF_USBD_INT_EP0DATADONE_MASK  | \
                                 NRF_USBD_INT_ENDEPIN0_MASK     | \
                                 NRF_USBD_INT_ENDEPOUT0_MASK    | \
                                 NRF_USBD_INT_USBEVENT_MASK     | \
                                 NRF_USBD_INT_EP0SETUP_MASK     | \
                                 NRF_USBD_INT_DATAEP_MASK       | \
                                 NRF_USBD_INT_ACCESSFAULT_MASK)
/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Low-Level Helpers ********************************************************/


static uint8_t nrf52_index2eplog(uint8_t index);
static uint8_t nrf52_eplog2index(uint8_t eplog);

/* Suspend/Resume Helpers ***************************************************/

static void   nrf52_suspend(struct nrf52_usbdev_s *priv);
static void   nrf52_initresume(struct nrf52_usbdev_s *priv, bool self_wakeup);
static void   nrf52_esofpoll(struct nrf52_usbdev_s *priv) ;

