redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
/* Request Helpers **********************************************************/

static struct nrf52_req_s *nrf52_rqdequeue(struct nrf52_ep_s *privep);
static void   nrf52_rqenqueue(struct nrf52_ep_s *privep,
                              struct nrf52_req_s *req);
static inline void
nrf52_abortrequest(struct nrf52_ep_s *privep,
                   struct nrf52_req_s *privreq, int16_t result);
static void   nrf52_reqcomplete(struct nrf52_ep_s *privep, int16_t result);
static void   nrf52_ep_rw_setup(struct nrf52_usbdev_s *priv,
                                struct nrf52_ep_s *privep, const uint8_t *data, uint32_t nbytes);
static int    nrf52_rw_request(struct nrf52_usbdev_s *priv,
                               struct nrf52_ep_s *privep);

static void   nrf52_cancelrequests(struct nrf52_ep_s *privep);

/* Interrupt level processing ***********************************************/
static void nrf52_ep0setup(struct nrf52_usbdev_s *priv);

static void   nrf52_epdone(struct nrf52_usbdev_s *priv, uint8_t epno);
static int    nrf52_usbd_interrupt(int irq, void *context, FAR void *arg);

/* Endpoint helpers *********************************************************/

static inline bool
nrf52_epreserved(struct nrf52_usbdev_s *priv, int epno);

static bool nrf52_rw_update_xfer(struct nrf52_ep_s *privep);

/* Endpoint operations ******************************************************/

static int  nrf52_epconfigure(struct usbdev_ep_s *ep,
                              const struct usb_epdesc_s *desc, bool last);
static int  nrf52_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *nrf52_epallocreq(struct usbdev_ep_s *ep);
static void nrf52_epfreereq(struct usbdev_ep_s *ep, struct usbdev_req_s *req);
#ifdef CONFIG_USBDEV_DMA
static void *nrf52_epallocbuffer(FAR struct usbdev_ep_s *ep, uint16_t bytes);
static void nrf52_epfreebuffer(FAR struct usbdev_ep_s *ep, FAR void *buf);
#endif
static int  nrf52_epsubmit(struct usbdev_ep_s *ep, struct usbdev_req_s *req);
static int  nrf52_epcancel(struct usbdev_ep_s *ep, struct usbdev_req_s *req);
static int  nrf52_epstall(struct usbdev_ep_s *ep, bool resume);

/* USB device controller operations *****************************************/

static struct usbdev_ep_s *
nrf52_allocep(struct usbdev_s *dev, uint8_t epno, bool in, uint8_t eptype);
static void nrf52_freeep(struct usbdev_s *dev, struct usbdev_ep_s *ep);
static int  nrf52_pullup(FAR struct usbdev_s *dev,  bool enable);
static int  nrf52_getframe(struct usbdev_s *dev);
static int  nrf52_wakeup(struct usbdev_s *dev);
static int  nrf52_selfpowered(struct usbdev_s *dev, bool selfpowered);

/* Initialization/Reset *****************************************************/

static void nrf52_reset(struct nrf52_usbdev_s *priv, bool hwreset);
static void nrf52_hwreset(struct nrf52_usbdev_s *priv);
static void nrf52_hwsetup(struct nrf52_usbdev_s *priv);
static void nrf52_hwshutdown(struct nrf52_usbdev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Since there is only a single USB interface, all status information can be
 * be simply retained in a single global instance.
 */

static struct nrf52_usbdev_s g_usbddev;

static const struct usbdev_epops_s g_epops =
{
  .configure   = nrf52_epconfigure,
  .disable     = nrf52_epdisable,
  .allocreq    = nrf52_epallocreq,
  .freereq     = nrf52_epfreereq,
#ifdef CONFIG_USBDEV_DMA
  .allocbuffer = nrf52_epallocbuffer,
  .freebuffer  = nrf52_epfreebuffer,
#endif
  .submit      = nrf52_epsubmit,
  .cancel      = nrf52_epcancel,
  .stall       = nrf52_epstall,
};

static const struct usbdev_ops_s g_devops =
{
  .allocep     = nrf52_allocep,
  .freeep      = nrf52_freeep,
  .getframe    = nrf52_getframe,
  .wakeup      = nrf52_wakeup,
  .selfpowered = nrf52_selfpowered,
  .pullup      = nrf52_pullup,
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_intdecode[] =
{
  TRACE_STR(NRF52_TRACEINTID_CLEARFEATURE       ),
  TRACE_STR(NRF52_TRACEINTID_DEVGETSTATUS       ),
  TRACE_STR(NRF52_TRACEINTID_DISPATCH           ),
  TRACE_STR(NRF52_TRACEINTID_EP0IN              ),
  TRACE_STR(NRF52_TRACEINTID_EP0INDONE          ),
  TRACE_STR(NRF52_TRACEINTID_EP0OUTDONE         ),
  TRACE_STR(NRF52_TRACEINTID_EP0SETUPDONE       ),
  TRACE_STR(NRF52_TRACEINTID_EP0SETUPSETADDRESS ),
  TRACE_STR(NRF52_TRACEINTID_EPGETSTATUS        ),
  TRACE_STR(NRF52_TRACEINTID_EPINDONE           ),
  TRACE_STR(NRF52_TRACEINTID_EPINQEMPTY         ),
  TRACE_STR(NRF52_TRACEINTID_EPOUTDONE          ),
  TRACE_STR(NRF52_TRACEINTID_EPOUTPENDING       ),
  TRACE_STR(NRF52_TRACEINTID_EPOUTQEMPTY        ),
  TRACE_STR(NRF52_TRACEINTID_ESOF               ),
  TRACE_STR(NRF52_TRACEINTID_GETCONFIG          ),
  TRACE_STR(NRF52_TRACEINTID_GETSETDESC         ),
  TRACE_STR(NRF52_TRACEINTID_GETSETIF           ),
  TRACE_STR(NRF52_TRACEINTID_GETSTATUS          ),
  TRACE_STR(NRF52_TRACEINTID_EPINTERRUPT        ),
  TRACE_STR(NRF52_TRACEINTID_IFGETSTATUS        ),
  TRACE_STR(NRF52_TRACEINTID_LPCTR              ),
  TRACE_STR(NRF52_TRACEINTID_RSTINTERRUPT        ),
  TRACE_STR(NRF52_TRACEINTID_NOSTDREQ           ),
  TRACE_STR(NRF52_TRACEINTID_RESET              ),
  TRACE_STR(NRF52_TRACEINTID_SETCONFIG          ),
  TRACE_STR(NRF52_TRACEINTID_SETFEATURE         ),
  TRACE_STR(NRF52_TRACEINTID_SUSP               ),
  TRACE_STR(NRF52_TRACEINTID_SYNCHFRAME         ),
  TRACE_STR(NRF52_TRACEINTID_WKUP               ),
  TRACE_STR(NRF52_TRACEINTID_EP0SETUPOUT        ),
  TRACE_STR(NRF52_TRACEINTID_EP0SETUPOUTDATA    ),
  TRACE_STR(NRF52_TRACEINTID_SETADDR            ),
  TRACE_STR_END
};
#endif

#ifdef CONFIG_USBDEV_TRACE_STRINGS
const struct trace_msg_t g_usb_trace_strings_deverror[] =
{
  TRACE_STR(NRF52_TRACEERR_ALLOCFAIL            ),
  TRACE_STR(NRF52_TRACEERR_BADCLEARFEATURE      ),
  TRACE_STR(NRF52_TRACEERR_BADDEVGETSTATUS      ),
  TRACE_STR(NRF52_TRACEERR_BADEPGETSTATUS       ),
  TRACE_STR(NRF52_TRACEERR_BADEPNO              ),
  TRACE_STR(NRF52_TRACEERR_BADEPTYPE            ),
  TRACE_STR(NRF52_TRACEERR_BADGETCONFIG         ),
  TRACE_STR(NRF52_TRACEERR_BADGETSETDESC        ),
  TRACE_STR(NRF52_TRACEERR_BADGETSTATUS         ),
  TRACE_STR(NRF52_TRACEERR_BADSETADDRESS        ),
  TRACE_STR(NRF52_TRACEERR_BADSETCONFIG         ),
  TRACE_STR(NRF52_TRACEERR_BADSETFEATURE        ),
  TRACE_STR(NRF52_TRACEERR_BINDFAILED           ),
  TRACE_STR(NRF52_TRACEERR_DISPATCHSTALL        ),
  TRACE_STR(NRF52_TRACEERR_DRIVER               ),
  TRACE_STR(NRF52_TRACEERR_DRIVERREGISTERED     ),
  TRACE_STR(NRF52_TRACEERR_EP0BADCTR            ),
  TRACE_STR(NRF52_TRACEERR_EP0SETUPSTALLED      ),
  TRACE_STR(NRF52_TRACEERR_EPBUFFER             ),
  TRACE_STR(NRF52_TRACEERR_EPDISABLED           ),
  TRACE_STR(NRF52_TRACEERR_EPOUTNULLPACKET      ),
  TRACE_STR(NRF52_TRACEERR_EPRESERVE            ),
  TRACE_STR(NRF52_TRACEERR_INVALIDCTRLREQ       ),
  TRACE_STR(NRF52_TRACEERR_INVALIDPARMS         ),
  TRACE_STR(NRF52_TRACEERR_IRQREGISTRATION      ),
  TRACE_STR(NRF52_TRACEERR_NOTCONFIGURED        ),
  TRACE_STR(NRF52_TRACEERR_REQABORTED           ),
  TRACE_STR_END
};
#endif

/****************************************************************************
 * Private Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_dispatchrequest
 ****************************************************************************/

static void nrf52_dispatchrequest(struct nrf52_usbdev_s *priv)
{
  int ret;

  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_DISPATCH), 0);
  if (priv && priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, &priv->ctrl,
                        priv->ep0data, priv->ep0datalen);
      if (ret < 0)
        {
          /* Stall on failure */

          usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_DISPATCHSTALL), 0);
          priv->ep0state = EP0STATE_STALLED;
        }
    }
}

