redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
static uint32_t nrf52_dma_flag ;
/****************************************************************************
 * Low-Level Helpers
 ****************************************************************************/
void nrf52_usbd_package_clear(void)
{
  g_usbddev.out_pack = 0;
  g_usbddev.out_cnt  = 0;
  g_usbddev.in_pack  = 0;
  g_usbddev.in_cnt   = 0;
}

uint32_t nrf52_usbd_get_out_pack(void)
{
  return g_usbddev.out_pack;
}

uint32_t nrf52_usbd_get_out_data_len(void)
{
  return g_usbddev.out_cnt;
}

uint32_t nrf52_usbd_get_in_pack(void)
{
  return g_usbddev.in_pack;
}

uint32_t nrf52_usbd_get_in_data_len(void)
{
  return g_usbddev.in_cnt;
}

/**
 * @brief Mark that EasyDMA is working.
 *
 * Internal function to set the flag informing about EasyDMA transfer pending.
 * This function is called always just after the EasyDMA transfer is started.
 */
static inline void nrf52_usbd_dma_pending_set(void)
{
  if (nrfx_usbd_errata_199())
    {
      *((volatile uint32_t *)0x40027C1C) = 0x00000082;
    }
  nrf52_dma_flag = true;
}

/**
 * @brief Mark that EasyDMA is free.
 *
 * Internal function to clear the flag informing about EasyDMA transfer pending.
 * This function is called always just after the finished EasyDMA transfer is detected.
 */
static inline void nrf52_usbd_dma_pending_clear(void)
{
  if (nrfx_usbd_errata_199())
    {
      *((volatile uint32_t *)0x40027C1C) = 0x00000000;
    }
  nrf52_dma_flag = false;
}

static void nrf52_usbd_transfer_out_drop(uint8_t ep)
{
  if (nrfx_usbd_errata_200())
    {
      *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7C5 + (2u * NRF_USBD_EP_NR_GET(ep));
      *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = 0;
      (void)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
    }
  else
    {
      if (!NRF_USBD_EPISO_CHECK(ep))
        {
          nrf_usbd_epout_clear(ep);
        }
    }
}

static void nrf52_usbd_setup_data_clear(void)
{
  if (nrfx_usbd_errata_104())
    {
      /* For this fix to work properly, it must be ensured that the task is
       * executed twice one after another - blocking ISR. This is however a temporary
       * solution to be used only before production version of the chip. */
      nrf_usbd_task_trigger(NRF_USBD_TASK_EP0RCVOUT);
      nrf_usbd_task_trigger(NRF_USBD_TASK_EP0RCVOUT);
    }
  else
    {
      nrf_usbd_task_trigger(NRF_USBD_TASK_EP0RCVOUT);
    }
}

static inline uint32_t __RBIT(uint32_t value)
{
  uint32_t result;

  __asm volatile ("rbit %0, %1" : "=r" (result) : "r" (value) );

  return (result);
}

/****************************************************************************
 * Name: nrf52_setimask
 ****************************************************************************/

static void
nrf52_setimask(struct nrf52_usbdev_s *priv, uint32_t setbits, uint32_t clrbits)
{

  /* Adjust the interrupt mask bits in the shadow copy first */

  priv->imask &= ~clrbits;
  priv->imask |= setbits;

  /* Then make the interrupt mask bits in the INTENSET / INTENCLR register
   */

  nrf_usbd_int_enable(setbits);
  nrf_usbd_int_disable(clrbits);

}

/****************************************************************************
 * Name: nrf52_ep_is_stalled
 ****************************************************************************/

static inline bool nrf52_ep_is_stalled(uint8_t eplog)
{
  return nrf_usbd_ep_is_stall(eplog);
}

/****************************************************************************
 * Name: nrf52_rqdequeue
 ****************************************************************************/

static struct nrf52_req_s *nrf52_rqdequeue(struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *ret = privep->head;

  if (ret)
    {
      privep->head = ret->flink;
      if (!privep->head)
        {
          privep->tail = NULL;
        }

      ret->flink = NULL;
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_rqenqueue
 ****************************************************************************/

static void nrf52_rqenqueue(struct nrf52_ep_s *privep, struct nrf52_req_s *req)
{
  req->flink = NULL;
  if (!privep->head)
    {
      privep->head = req;
      privep->tail = req;
    }
  else
    {
      privep->tail->flink = req;
      privep->tail        = req;
    }
}

/****************************************************************************
 * Name: nrf52_abortrequest
 ****************************************************************************/

static inline void
nrf52_abortrequest(struct nrf52_ep_s *privep, struct nrf52_req_s *privreq, int16_t result)
{
  usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_REQABORTED), (uint16_t)USB_EPNO(privep->ep.eplog));

  /* Save the result in the request structure */

  privreq->req.result = result;

  /* Callback to the request completion handler */

  privreq->req.callback(&privep->ep, &privreq->req);
}

/****************************************************************************
 * Name: nrf52_reqcomplete
 ****************************************************************************/

static void nrf52_reqcomplete(struct nrf52_ep_s *privep, int16_t result)
{
  struct nrf52_req_s *privreq;
  irqstate_t flags;

  /* Remove the completed request at the head of the endpoint request list */

  flags = enter_critical_section();
  privreq = nrf52_rqdequeue(privep);
  leave_critical_section(flags);

  if (privreq)
    {
      /* If endpoint 0, temporarily reflect the state of protocol stalled
       * in the callback.
       */

      bool stalled = privep->stalled;
      if (USB_EPNO(privep->ep.eplog) == EP0)
        {
          privep->stalled = (privep->dev->ep0state == EP0STATE_STALLED);
        }

      /* Save the result in the request structure */

      privreq->req.result = result;

      /* Callback to the request completion handler */

      privreq->req.callback(&privep->ep, &privreq->req);

      /* Restore the stalled indication */

      privep->stalled = stalled;
    }
}

/****************************************************************************
 * Name: nrf52_epwrite
 ****************************************************************************/

