redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
static void nrf52_ep_rw_setup(struct nrf52_usbdev_s *priv,
                              struct nrf52_ep_s *privep,
                              const uint8_t *buf, uint32_t nbytes)
{
  uint8_t epno = USB_EPNO(privep->ep.eplog);
  /* setup the easyDMA buffer and size and start transfer */
  nrf_usbd_task_t task;
  nrf_usbd_int_mask_t int_mask;

  usbtrace(TRACE_WRITE(epno), nbytes);

  if (nbytes > 0 || (nbytes == 0 && privep->txnullpkt))
    {

      /* set started , end interrupt */
      if (USB_ISEPOUT(privep->ep.eplog))
        {
          task = NRF_USBD_TASK_STARTEPOUT0 + epno * 4;
          int_mask = 1 << (USBD_INTEN_ENDEPOUT0_Pos + epno);
          epno |= USB_DIR_OUT;
        }
      else
        {
          task = NRF_USBD_TASK_STARTEPIN0 + epno * 4;
          int_mask = 1 << (USBD_INTEN_ENDEPIN0_Pos + epno);
          epno |= USB_DIR_IN;
        }

      /* NOT use dual buffer mode now . will be support in further
       *     int_mask |= NRF_USBD_INT_STARTED_MASK;
       */
      nrf52_usbd_dma_pending_set();
      privep->txnullpkt = 0;
      nrf_usbd_ep_easydma_set(epno, (uint32_t)buf, nbytes);

      privep->busy = true;

      nrf52_setimask(priv, int_mask, 0);
      nrf_usbd_task_trigger(task);
    }

}

/****************************************************************************
 * Interrupt Level Processing
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_wrrequest_ep0
 *
 * Description:
 *   Handle the ep0 state on writes.
 *
 ****************************************************************************/

inline static int nrf52_wrrequest_ep0(struct nrf52_usbdev_s *priv,
                                      struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *privreq = NULL;
  uint8_t *buf = NULL;
  int nbytes = 0;
  int bytesleft;
  bool one_shot = false;
  uint8_t epno = 0;
  nrf_usbd_task_t task;
  uint32_t int_mask = 0;

  /* Check the request from the head of the endpoint request queue */

  privreq = nrf52_reqpeek(privep);
  if (!privreq)
    {
      /* There is no TX transfer in progress and no new pending TX
       * requests to send.
       */

      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPINQEMPTY), 0);
      return -ENOENT;
    }

  uinfo("epno=%d req=%p: len=%d xfrd=%d nullpkt=%d\n", privep->ep.eplog, privreq,
        privreq->req.len, privreq->req.xfrd, privep->txnullpkt);

  /* Get the number of bytes left to be sent in the packet */

  bytesleft         = privreq->req.len - privreq->req.xfrd;
  nbytes            = bytesleft;

  /* If we are not sending a NULL packet, then clip the size to maxpacket
   * and check if we need to send a following NULL packet.
   */

  if (nbytes > privep->ep.maxpacket)
    {
      nbytes =  privep->ep.maxpacket;
    }
  else
    {
      one_shot = true;
    }

  /* Send the packet (might be a null packet nbytes == 0) */

  buf = privreq->req.buf + privreq->req.xfrd;
  /* set started , end interrupt */

  task = NRF_USBD_TASK_STARTEPIN0;
  int_mask = 1 << (USBD_INTEN_ENDEPIN0_Pos);
  epno |= USB_DIR_IN;

  nrf52_usbd_dma_pending_set();
  nrf_usbd_ep_easydma_set(epno, (uint32_t)buf, nbytes);

  if (one_shot)
    {
      nrf52_trace("one shot: len %d\n", nbytes);
      nrf_usbd_shorts_enable(NRF_USBD_SHORT_EP0DATADONE_EP0STATUS_MASK);
      nrf52_setimask(priv, int_mask, 0);
      nrf_usbd_task_trigger(task);
      privreq->req.xfrd = nbytes;
      nrf52_reqcomplete(privep, OK);
      priv->ep0state = EP0STATE_IDLE;

    }
  else
    {
      nrf52_trace("NOT one shot\n");
      nrf52_setimask(priv, int_mask, 0);
      nrf_usbd_task_trigger(task);
      priv->ep0state = EP0STATE_WRREQUEST;
    }

  return OK;
}

/****************************************************************************
 * Name: nrf52_ep0setup_status
 * epno: the logic no which includes direction attribute
 ****************************************************************************/
static void nrf52_ep0setup_status(void)
{
  nrf_usbd_task_trigger(NRF_USBD_TASK_EP0STATUS);
}

/****************************************************************************
 * Name: nrf52_ep0out_end
 ****************************************************************************/
static inline void nrf52_ep0out_end(struct nrf52_usbdev_s *priv)
{
  uint32_t size;

  size = nrf_usbd_epout_size_get(USB_DIR_OUT);
  nrf52_trace("ep0 out size: %d., status %d\n", size, priv->ep0state);

  priv->ep0state = EP0STATE_SETUP_READY;
  nrf52_ep0setup(priv);

  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0OUTDONE), 0xF);
}

/****************************************************************************
 * Name: nrf52_ep0in_datadone
 ****************************************************************************/
static inline void nrf52_ep0in_datadone(struct nrf52_usbdev_s *priv)
{

  if (priv->ep0dir != true)
    {
      nrf52_trace("only accept IN epdatadone event\n");
      return;
    }

  /* EP0 IN: device-to-host (DIR=0) */

  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0INDONE), 0);

  priv->eplist[EP0_IN].busy = false;

  if (priv->ep0state == EP0STATE_WRREQUEST)
    {
      /* Are we processing the completion of one packet of an outgoing request
       * from the class driver?
       */

      if (NULL == nrf52_reqpeek(&priv->eplist[EP0_IN]))
        {
          nrf52_ep0setup_status();

          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0INDONE), 2);
          priv->ep0state = EP0STATE_IDLE;
        }
      else
        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0INDONE), 3);
          /* update write data point */
          nrf52_rw_update_xfer(&priv->eplist[EP0_IN]);
          nrf52_wrrequest_ep0(priv, &priv->eplist[EP0_IN]);
        }
    }

}

/****************************************************************************
 * Name: nrf52_rdrequest_ep0
 *
 * Description:
 *   This function is called from the nrf52_ep0_setup handler when the ep0state
 *   is EP0STATE_SETUP_OUT and it will setup EP0 OUT data stage.
 *
 ****************************************************************************/

