redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
static void nrf52_rdrequest_ep0(struct nrf52_usbdev_s *priv, uint8_t *buf, uint32_t len)
{
  uint8_t epno = 0 | USB_DIR_OUT;

  ASSERT(priv->ep0state == EP0STATE_SETUP_OUT);

  /* setup easydma & start data stage on OUT traction : 52840 Page: 489
   * use shortcut to start OUT0 transfer, and ENDOUT0 will be generated
   */
  nrf52_usbd_dma_pending_set();
  nrf52_usbd_transfer_out_drop(USB_DIR_OUT);

  nrf_usbd_ep_easydma_set(epno, (uint32_t)buf, len);

  nrf52_setimask(priv, USBD_INTEN_ENDEPOUT0_Pos, 0);

  nrf_usbd_shorts_enable(NRF_USBD_SHORT_EP0DATADONE_STARTEPOUT0_MASK);

  nrf52_usbd_setup_data_clear();
}

static void nrf52_readsetup(struct usb_ctrlreq_s *ctrl)
{
  uint16_t data;

  ctrl->type     = nrf_usbd_setup_bmrequesttype_get();
  ctrl->req      = nrf_usbd_setup_brequest_get();

  data           = nrf_usbd_setup_wvalue_get();
  ctrl->value[0] = data & 0xFF;
  ctrl->value[1] = (data >> 8) & 0xFF;

  data           = nrf_usbd_setup_windex_get();
  ctrl->index[0] = data & 0xFF;
  ctrl->index[1] = (data >> 8) & 0xFF;

  data           = nrf_usbd_setup_wlength_get();
  ctrl->len[0]   = data & 0xFF;
  ctrl->len[1]   = (data >> 8) & 0xFF;

}

/****************************************************************************
 * Name: nrf52_ep0setup
 ****************************************************************************/
static void nrf52_setup_response_in(struct nrf52_usbdev_s *priv, uint8_t *buf, uint32_t len)
{

  nrf52_usbd_dma_pending_set();
  nrf_usbd_ep_easydma_set(USB_DIR_IN, (uint32_t)buf, len);

  nrf_usbd_shorts_enable(NRF_USBD_SHORT_EP0DATADONE_EP0STATUS_MASK);

  /* on the end interrupt to clear dma_pending */
  nrf52_setimask(priv, USBD_INTEN_ENDEPIN0_Pos, 0);
  nrf_usbd_task_trigger(NRF_USBD_TASK_STARTEPIN0);

}

static void nrf52_ep0setup(struct nrf52_usbdev_s *priv)
{

  struct nrf52_ep_s   *ep0 = NULL;
  struct nrf52_req_s  *privreq = NULL;
  struct nrf52_ep_s   *privep = NULL;
  uint16_t            value;
  uint16_t            index;
  uint16_t            len;
  uint8_t             response[2];
  bool                handled = false;
  uint8_t             epno;
  int                 nbytes = 0; /* Assume zero-length packet */

  /* disable short cut firstly */
  nrf_usbd_shorts_disable(0xFFFFUL);

  /* Check to see if called from the DATA phase of a SETUP Transfer */

  if (priv->ep0state != EP0STATE_SETUP_READY)
    {
      /* Now, extract setup command data */

      nrf52_readsetup(&priv->ctrl);

      value = GETUINT16(priv->ctrl.value);
      index = GETUINT16(priv->ctrl.index);
      len   = GETUINT16(priv->ctrl.len);

      nrf52_trace("SETUP: type=%02x req=%02x value=%04x index=%04x len=%#04x\n",
                  priv->ctrl.type, priv->ctrl.req, value, index, len);

      /* Is this an setup with OUT */

      if (USB_REQ_ISOUT(priv->ctrl.type))
        {

          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0SETUPOUT), len);

          /* At this point priv->ctrl is the setup packet. */
          ep0     = &priv->eplist[EP0_OUT];

          priv->ep0dir = false;
          /*  we need to setup ep0 data transfer here */
          priv->ep0datalen = len;

          if (len > 0)
            {
              priv->ep0state = EP0STATE_SETUP_OUT;

              nrf52_rdrequest_ep0(priv, priv->ep0data, len);
              return;
            }
          else
            {
              priv->ep0state = EP0STATE_SETUP_READY;
            }
        }
      else
        {
          ep0     = &priv->eplist[EP0_IN];
          priv->ep0dir = true;
          priv->ep0state = EP0STATE_SETUP_READY;
        }
    }
  else
    {
      nrf52_trace("ep0state is SETUP_READY, ep0dir %s.\n", priv->ep0dir ? "IN" : "OUT");
      nrf52_trace("ep0_OUT : %#x, ep0_IN : %#x.\n", priv->eplist[EP0_OUT].ep.eplog,
                  priv->eplist[EP0_IN].ep.eplog);

      if (false == priv->ep0dir)
        {
          ep0 = &priv->eplist[EP0_OUT];
        }
      else
        {
          ep0 = &priv->eplist[EP0_IN];
        }
    }

  /* Terminate any pending requests (doesn't work if the pending request
   * was a zero-length transfer!)
   */
  privreq = nrf52_reqpeek(ep0);

  while (!nrf52_reqempty(ep0))
    {
      int16_t result = OK;
      if (privreq->req.xfrd != privreq->req.len)
        {
          result = -EPROTO;
        }

      usbtrace(TRACE_COMPLETE(ep0->ep.eplog), privreq->req.xfrd);
      nrf52_reqcomplete(ep0, result);
    }

  /* Assume NOT stalled; no TX in progress */

  ep0->stalled  = 0;
  ep0->busy   = 0;

  /* Dispatch any non-standard requests */

  if ((priv->ctrl.type & USB_REQ_TYPE_MASK) != USB_REQ_TYPE_STANDARD)
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_NOSTDREQ), priv->ctrl.type);

      /* Let the class implementation handle all non-standar requests */
      nrf52_dispatchrequest(priv);
      return;
    }

  /* Handle standard request.  Pick off the things of interest to the
   * USB device controller driver; pass what is left to the class driver
   */
  response[0] = 0;
  response[1] = 0;

  switch (priv->ctrl.req)
    {
      case USB_REQ_GETSTATUS:
        {
          /* type:  device-to-host; recipient = device, interface, endpoint
           * value: 0
           * index: zero interface endpoint
           * len:   2; data = status
           */

          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_GETSTATUS), priv->ctrl.type);
          if (len != 2 || (priv->ctrl.type & USB_REQ_DIR_IN) == 0 ||
              index != 0 || value != 0)
            {
              usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADEPGETSTATUS), 0);
              priv->ep0state = EP0STATE_STALLED;
            }
          else
            {
              switch (priv->ctrl.type & USB_REQ_RECIPIENT_MASK)
                {
                  case USB_REQ_RECIPIENT_ENDPOINT:
                    {
                      epno = USB_EPNO(index);
                      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPGETSTATUS), epno);
                      if (epno >= NRF52_NENDPOINTS)
                        {
                          usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADEPGETSTATUS), epno);
                          priv->ep0state = EP0STATE_STALLED;
                        }
                      else
                        {
                          nbytes     = 2; /* Response size: 2 bytes */

                          if (nrf52_ep_is_stalled(0xFF & index))
                            {
                              /* IN Endpoint stalled */

                              response[0] = 1; /* Stalled */
                            }
                        }
                    }
                    break;

