redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
                  case USB_REQ_RECIPIENT_DEVICE:
                    {
                      if (index == 0)
                        {
                          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_DEVGETSTATUS), 0);

                          /* Features:  Remote Wakeup=YES; selfpowered=? */

                          response[0] = (priv->selfpowered << USB_FEATURE_SELFPOWERED) |
                                        (1 << USB_FEATURE_REMOTEWAKEUP);
                          nbytes      = 2; /* Response size: 2 bytes */
                        }
                      else
                        {
                          usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADDEVGETSTATUS), 0);
                          priv->ep0state = EP0STATE_STALLED;
                        }
                    }
                    break;

                  case USB_REQ_RECIPIENT_INTERFACE:
                    {
                      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_IFGETSTATUS), 0);
                      nbytes  = 2; /* Response size: 2 bytes */
                    }
                    break;

                  default:
                    {
                      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADGETSTATUS), 0);
                      priv->ep0state = EP0STATE_STALLED;
                    }
                    break;
                }
            }
        }
        break;

      case USB_REQ_CLEARFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface or endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   zero, data = none
           */

          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_CLEARFEATURE), priv->ctrl.type);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) != USB_REQ_RECIPIENT_ENDPOINT)
            {
              /* Let the class implementation handle all recipients (except for the
               * endpoint recipient)
               */

              nrf52_dispatchrequest(priv);
              handled = true;
            }
          else
            {
              /* Endpoint recipient */

              epno = USB_EPNO(index);
              if (epno < NRF52_NENDPOINTS &&
                  value == USB_FEATURE_ENDPOINTHALT && len == 0)
                {
                  usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_CLEARFEATURE), index);

                  if (nrf_usbd_dtoggle_get(index) != NRF_USBD_DTOGGLE_DATA0)
                    {
                      nrf_usbd_dtoggle_set(index, NRF_USBD_DTOGGLE_DATA0);
                    }

                  privep = &priv->eplist[nrf52_eplog2index(index)];
                  (void)nrf52_epstall(&privep->ep, true);
                  priv->ep0state = EP0STATE_IDLE;
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADCLEARFEATURE), 0);
                  priv->ep0state = EP0STATE_STALLED;
                }
            }
        }
        break;

      case USB_REQ_SETFEATURE:
        {
          /* type:  host-to-device; recipient = device, interface, endpoint
           * value: feature selector
           * index: zero interface endpoint;
           * len:   0; data = none
           */

          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SETFEATURE), priv->ctrl.type);
          if (((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_DEVICE) &&
              value == USB_FEATURE_TESTMODE)
            {
              /* Special case recipient=device test mode */

              uinfo("test mode: %d\n", index);
            }
          else if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) != USB_REQ_RECIPIENT_ENDPOINT)
            {
              /* The class driver handles all recipients except recipient=endpoint */

              nrf52_dispatchrequest(priv);
              handled = true;
            }
          else
            {
              /* Handler recipient=endpoint */

              usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SETFEATURE), index);

              epno = USB_EPNO(index);
              if (epno < NRF52_NENDPOINTS &&
                  value == USB_FEATURE_ENDPOINTHALT && len == 0)
                {
                  privep = &priv->eplist[nrf52_eplog2index(index)];
                  (void)nrf52_epstall(&privep->ep, false);
                }
              else
                {
                  usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADSETFEATURE), 0);
                  priv->ep0state = EP0STATE_STALLED;
                }
            }
        }
        break;

      case USB_REQ_SETADDRESS:
        {
          /* type:  host-to-device; recipient = device
           * value: device address
           * index: 0
           * len:   0; data = none
           */
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_DEVICE &&
              index  == 0 && len == 0 && value < 128)
            {
              /* usb controller had handled set-address cmd , didn't need to
               * do status stage init action
               */
              usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0SETUPSETADDRESS), value);
              priv->ep0state = EP0STATE_IDLE;
              handled = true;
            }
          else
            {
              priv->ep0state = EP0STATE_STALLED;
            }
          /* Note that setting of the device address will be deferred.  A zero-length
           * packet will be sent and the device address will be set when the zero-
           * length packet transfer completes.
           */
        }
        break;

      case USB_REQ_GETDESCRIPTOR:
      /* type:  device-to-host; recipient = device
       * value: descriptor type and index
       * index: 0 or language ID;
       * len:   descriptor len; data = descriptor
       */
      case USB_REQ_SETDESCRIPTOR:
        /* type:  host-to-device; recipient = device
         * value: descriptor type and index
         * index: 0 or language ID;
         * len:   descriptor len; data = descriptor
         */

        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_GETSETDESC), priv->ctrl.type);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_DEVICE)
            {
              /* The request seems valid... let the class implementation handle it */

              nrf52_dispatchrequest(priv);
              handled = true;
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADGETSETDESC), 0);
              priv->ep0state = EP0STATE_STALLED;
            }
        }
        break;

      case USB_REQ_GETCONFIGURATION:
        /* type:  device-to-host; recipient = device
         * value: 0;
         * index: 0;
         * len:   1; data = configuration value
         */

        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_GETCONFIG), priv->ctrl.type);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_DEVICE &&
              value == 0 && index == 0 && len == 1)
            {
              /* The request seems valid... let the class implementation handle it */

              nrf52_dispatchrequest(priv);
              handled = true;
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADGETCONFIG), 0);
              priv->ep0state = EP0STATE_STALLED;
            }
        }
        break;

