redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
      case USB_REQ_SETCONFIGURATION:
        /* type:  host-to-device; recipient = device
         * value: configuration value
         * index: 0;
         * len:   0; data = none
         */

        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SETCONFIG), priv->ctrl.type);
          if ((priv->ctrl.type & USB_REQ_RECIPIENT_MASK) == USB_REQ_RECIPIENT_DEVICE &&
              index == 0 && len == 0)
            {
              /* The request seems valid... let the class implementation handle it */

              nrf52_dispatchrequest(priv);
              handled = true;
            }
          else
            {
              usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADSETCONFIG), 0);
              priv->ep0state = EP0STATE_STALLED;
            }
        }
        break;

      case USB_REQ_GETINTERFACE:
      /* type:  device-to-host; recipient = interface
       * value: 0
       * index: interface;
       * len:   1; data = alt interface
       */
      case USB_REQ_SETINTERFACE:
        /* type:  host-to-device; recipient = interface
         * value: alternate setting
         * index: interface;
         * len:   0; data = none
         */

        {
          /* Let the class implementation handle the request */

          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_GETSETIF), priv->ctrl.type);
          nrf52_dispatchrequest(priv);
          handled = true;
        }
        break;

      case USB_REQ_SYNCHFRAME:
        /* type:  device-to-host; recipient = endpoint
         * value: 0
         * index: endpoint;
         * len:   2; data = frame number
         */

        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SYNCHFRAME), 0);
        }
        break;

      default:
        {
          usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDCTRLREQ), priv->ctrl.req);
          priv->ep0state = EP0STATE_STALLED;
        }
        break;
    }

  /* At this point, the request has been handled and there are three possible
   * outcomes:
   *
   * 1. The setup request was successfully handled above and a response packet
   *    must be sent (may be a zero length packet).
   * 2. The request was successfully handled by the class implementation.  In
   *    case, the EP0 IN response has already been queued and the local variable
   *    'handled' will be set to true and ep0state != EP0STATE_STALLED;
   * 3. An error was detected in either the above logic or by the class implementation
   *    logic.  In either case, priv->state will be set EP0STATE_STALLED
   *    to indicate this case.
   *
   * NOTE: Non-standard requests are a special case.  They are handled by the
   * class implementation and this function returned early above, skipping this
   * logic altogether.
   */

  if (EP0STATE_STALLED == priv->ep0state)
    {
      nrf52_trace("Setup stalled.\n");
      nrf_usbd_task_trigger(NRF_USBD_TASK_EP0STALL);
    }

  if (priv->ep0state != EP0STATE_STALLED && !handled)
    {
      /* We will response.  First, restrict the data length to the length
       * requested in the setup packet
       */

      if (nbytes > len)
        {
          nbytes = len;
        }

      /* Send the response (might be a zero-length packet) */

      if (0 == nbytes)
        {
          /* just finish setup stage , starting status stage */
          nrf52_ep0setup_status();
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0SETUPOUTDATA), 1);
          priv->ep0state = EP0STATE_IDLE;
        }
      else
        {
          priv->ep0data[0] = response[0];
          priv->ep0data[1] = response[1];
          if (false == priv->ep0dir)
            {
              nrf52_trace("NOT in direction.\n");
            }
          nrf52_setup_response_in(priv, priv->ep0data, nbytes);

          priv->ep0state = EP0STATE_IDLE;
        }
    }
}

/****************************************************************************
 * Name: nrf52_wrrequest | nrf52_wrrequest_update_xfer
 * nrf52_rw_update_xfer : return true for continue TX , false , TX done
 ****************************************************************************/
static bool nrf52_rw_update_xfer(struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *privreq;
  uint16_t  bytesleft;
  uint16_t xfer_len;

  privreq = nrf52_reqpeek(privep);

  if (NULL == privreq)
    {
      /* NO request on queue */
      privep->busy = false;
      return false;
    }

  if (USB_ISEPOUT(privep->ep.eplog))
    {
      xfer_len = nrf_usbd_ep_amount_get(privep->ep.eplog);

      privep->busy = false;
      g_usbddev.out_cnt += xfer_len;
      privreq->req.xfrd += xfer_len;

      usbtrace(TRACE_COMPLETE(USB_EPNO(privep->ep.eplog)), privreq->req.xfrd);

      nrf52_reqcomplete(privep, OK);

      return false;

    }
  else
    {
      xfer_len = nrf_usbd_ep_amount_get(privep->ep.eplog);
      g_usbddev.in_cnt += xfer_len;
    }

  /* Update for the next data IN interrupt */

  privreq->req.xfrd += xfer_len;
  bytesleft          = privreq->req.len - privreq->req.xfrd;

  /* If all of the bytes were sent (including any final null packet)
   * then we are finished with the request buffer).
   */

  if (bytesleft == 0)
    {
      /* Return the write / read request to the class driver */

      usbtrace(TRACE_COMPLETE(USB_EPNO(privep->ep.eplog)), privreq->req.xfrd);
      privep->txnullpkt = 0;
      privep->busy = false;
      nrf52_reqcomplete(privep, OK);

      return false;
    }

  return true;
}

static int nrf52_rw_request(struct nrf52_usbdev_s *priv, struct nrf52_ep_s *privep)
{
  struct nrf52_req_s *privreq;
  uint8_t *buf;
  int nbytes;
  int bytesleft;

  /* Check the request from the head of the endpoint request queue */

  privreq = nrf52_reqpeek(privep);
  if (!privreq)
    {
      /* There is no TX transfer in progress and no new pending TX
       * requests to send.
       */

      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EPINQEMPTY), 0);
      return -ENOENT;
    }

  uinfo("epno=%d req=%p: len=%d xfrd=%d nullpkt=%d\n", privep->ep.eplog, privreq,
        privreq->req.len, privreq->req.xfrd, privep->txnullpkt);

  /* Get the number of bytes left to be sent in the packet */

  bytesleft         = privreq->req.len - privreq->req.xfrd;
  nbytes            = bytesleft;

  /* If we are not sending a NULL packet, then clip the size to maxpacket
   * and check if we need to send a following NULL packet.
   */

  if (USB_ISEPIN(privep->ep.eplog))
    {
      /* Device to Host */
      if ( nbytes >= privep->ep.maxpacket)
        {
          nbytes =  privep->ep.maxpacket;
        }
    }
  else
    {
      /* Host to Device */
      if (privep->req_len <= nbytes)
        {
          nbytes = privep->req_len;
        }
      else
        {
          uerr("OUT: request buffer is NOT enough big.\n");
        }
    }
  /* Send the packet (might be a null packet nbytes == 0) */

  buf = privreq->req.buf + privreq->req.xfrd;
  nrf52_ep_rw_setup(priv, privep, buf, nbytes);

  return OK;
}


/****************************************************************************
 * Name: nrf52_cancelrequests
 ****************************************************************************/

static void nrf52_cancelrequests(struct nrf52_ep_s *privep)
{
  while (!nrf52_reqempty(privep))
    {
      usbtrace(TRACE_COMPLETE(USB_EPNO(privep->ep.eplog)),
               (nrf52_reqpeek(privep))->req.xfrd);
      nrf52_reqcomplete(privep, -ESHUTDOWN);
    }
}

static void nrf52_epdone(struct nrf52_usbdev_s *priv, uint8_t epno)
{
  struct nrf52_ep_s *privep;
  uint8_t logno = nrf52_eplog2index(epno);
  /* Decode and service non control endpoints interrupt */

  privep = &priv->eplist[logno];

  /* We get here when an END Event of  endpoint interrupt occurs.
   * 1. started event (indicate  the second buffer can be passed)
   * 2. endpoint event (indicate the easyDMA done)
   */

  nrf52_trace(" EP End Event: epno %#x.\n", epno);

  nrf52_usbd_dma_pending_clear();

  nrf52_rw_update_xfer(privep);

