redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
}

/****************************************************************************
 * Name: nrf52_usbd_isr_handle
 * this api only handle reset / resume / suspend
 ****************************************************************************/

static int nrf52_usbd_isr_handle(void)
{

  struct nrf52_usbdev_s *priv = &g_usbddev;

  /* Handle Reset interrupts.  When this event occurs, the peripheral is left
   * in the same conditions it is left by the system reset (but with the
   * USB controller enabled).
   */

  if (nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_USBRESET))
    {
      /* Reset interrupt received. Clear the RESET interrupt status. */

      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_RESET), 0);
      nrf52_trace("Reset Event.\n");
      /* Restore our power-up state and exit now because istr is no longer
       * valid.
       */

//      nrf52_reset(priv, false);
    }

  /* Handle resume interrupts.  This interrupt is only enable while the USB is
   * suspended.
   */

  if (nrf_usbd_int_enable_check(NRF_USBD_INT_USBEVENT_MASK) &&
      nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_USBEVENT))
    {

      uint32_t cause = nrf_usbd_eventcause_get();

      nrf52_trace("USB Event: %#x.\n", cause);

      /* Wakeup interrupt received. Clear the WKUP interrupt status.  The
       * cause of the resume is indicated in the FNR register
       */
      usbtrace(TRACE_INTENTRY(NRF52_TRACEINTID_RSTINTERRUPT), (uint16_t)cause);

      if (cause & NRF_USBD_EVENTCAUSE_SUSPEND_MASK)
        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_SUSP), 0);
          nrf52_trace("Suspend Event.\n");

          /* Clear of the suspend bit must be done after */

          nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_SUSPEND_MASK);

          nrf52_suspend(priv);
        }

      /* reset usb event data */
      cause = nrf_usbd_eventcause_get();

      if (cause & NRF_USBD_EVENTCAUSE_RESUME_MASK)
        {
          usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_WKUP), 0);
          nrf52_trace("Resume Event.\n");

          nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_RESUME_MASK);

          if (priv->phystatus <= NRF52_USBPHY_STATUS_REMOVE)
            {
              nrf52_initresume(priv, false);
            }
          priv->rsmstate = RSMSTATE_IDLE;
        }

    }

  /* handle SOF for reusme condition */
  if (nrf_usbd_int_enable_check(NRF_USBD_INT_SOF_MASK) &&
      nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_SOF))
    {

      /* Resume handling timing is made with ESOFs */

      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_ESOF), 0);
      nrf52_esofpoll(priv);
    }

  return OK;
}

/****************************************************************************
 * Name: nrf52_usbd_interrupt
 ****************************************************************************/
static int nrf52_usbd_interrupt(int irq, void *context, FAR void *arg)
{
  /* For now there is only one USB controller, but we will always refer to
   * it using a pointer to make any future ports to multiple USB controllers
   * easier.
   */

  struct nrf52_usbdev_s *priv = &g_usbddev;

  usbtrace(TRACE_INTENTRY(NRF52_TRACEINTID_EPINTERRUPT), 0);

  uint8_t  epno = 0;
  uint32_t event_epin = NRF_USBD_EVENT_ENDEPIN0;
  uint32_t event_epout = NRF_USBD_EVENT_ENDEPOUT0;

  uint32_t in_mask    = NRF_USBD_INT_ENDEPIN0_MASK;
  uint32_t out_mask    = NRF_USBD_INT_ENDEPOUT0_MASK;


  /* always handle ctrl EP firstly , because only one EP transfer for one time */
  /* handle setup stage */
  if (nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_EP0SETUP))
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0SETUPOUTDATA), 0);

      nrf52_ep0setup(priv);
    }

  /* handle ctrl point IN data transaction end */
  if (nrf_usbd_int_enable_check(in_mask) && nrf_usbd_event_get_and_clear(event_epin))
    {
      nrf52_trace("EP0 IN End\n");
      nrf52_usbd_dma_pending_clear();
    }

  /* handle ctrl point OUT data transaction end */
  if (nrf_usbd_int_enable_check(out_mask) && nrf_usbd_event_get_and_clear(event_epout))
    {
      nrf52_trace("EP0 OUT End\n");

      nrf52_usbd_dma_pending_clear();
      nrf_usbd_shorts_disable(NRF_USBD_SHORT_EP0DATADONE_STARTEPOUT0_MASK);
      nrf52_ep0out_end(priv);
    }

  /* handle ctrl point IN data transaction Done */
  if (nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_EP0DATADONE))
    {
      usbtrace(TRACE_INTDECODE(NRF52_TRACEINTID_EP0SETUPDONE), 0);

      nrf52_ep0in_datadone(priv);
    }

  /* handle normal endpoint end ISR */

  epno = 1;
  event_epin = NRF_USBD_EVENT_ENDEPIN1;
  event_epout = NRF_USBD_EVENT_ENDEPOUT1;

  in_mask    = NRF_USBD_INT_ENDEPIN1_MASK;
  out_mask    = NRF_USBD_INT_ENDEPOUT1_MASK;

  do
    {
      if (nrf_usbd_int_enable_check(in_mask) && nrf_usbd_event_get_and_clear(event_epin))
        {
          uint8_t tick_delay = 100;
          do
            {
              int32_t ack_flag = nrf_usbd_epdatastatus_get() && (1 << epno);
              if (ack_flag)
                {
                  break;
                }
              else
                {
                  up_udelay(1);
                }
            }
          while (tick_delay--);

          nrf52_epdone(priv, epno | NRF_USBD_EP_DIR_IN);
        }

      if (nrf_usbd_int_enable_check(out_mask) && nrf_usbd_event_get_and_clear(event_epout))
        {
          nrf52_epdone(priv, epno | NRF_USBD_EP_DIR_OUT);
        }

      epno++;
      event_epin += 4;
      event_epout += 4;
      in_mask <<= 1;
      out_mask <<= 1;
    }
  while (event_epin <= NRF_USBD_EVENT_ENDEPIN7);

  /* handle ISO endpoint ISR */
  if (nrf_usbd_int_enable_check(NRF_USBD_INT_ENDISOIN0_MASK))
    {
      if (nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_ENDISOIN0))
        {
          nrf52_epdone(priv, 8 | NRF_USBD_EP_DIR_IN);
        }
    }

  if (nrf_usbd_int_enable_check(NRF_USBD_INT_ENDISOOUT0_MASK))
    {
      if (nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_ENDISOOUT0))
        {
          nrf52_epdone(priv, 8 | NRF_USBD_EP_DIR_OUT);
        }
    }

  /* handle bulk | interrupt  OUT / IN ACK transaction */
  if (nrf_usbd_event_get_and_clear(NRF_USBD_EVENT_DATAEP))
    {
      uint32_t epdatastatus = nrf_usbd_epdatastatus_get_and_clear();

