redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
      uint32_t epin_mask = NRF_USBD_EPDATASTATUS_EPIN1_MASK;

      uint32_t epout_mask = NRF_USBD_EPDATASTATUS_EPOUT1_MASK;
      uint8_t epno_index ;

      for ( epno = 1; epno < 8; epno++)
        {
          /* handle IN transaction */
          if (epin_mask & epdatastatus)
            {
              priv->in_pack++;
              epno_index = nrf52_eplog2index(epno | USB_DIR_IN);
              struct nrf52_ep_s *privep = &priv->eplist[epno_index];

              if (!nrf52_reqempty(privep) && false == nrf52_dma_flag)
                {
                  /* Continuing current un-finished Write request */
                  nrf52_rw_request(priv, privep);
                }
            }
          epin_mask <<= 1;

          /* Handle OUT transaction */
          if (epout_mask & epdatastatus)
            {
              epno_index = nrf52_eplog2index(epno | USB_DIR_OUT);

              uint32_t out_size = nrf_usbd_epout_size_get(epno);
              uinfo("\t EP_Status : epno %d, size %d.\n", (epno | USB_DIR_OUT), out_size);

              priv->out_pack++;

              uinfo("OUT transaction : pack %d, out_data_len %d.\n", priv->out_pack, priv->out_cnt);
              priv->eplist[epno_index].req_len = out_size;;
              ASSERT(priv->eplist[epno_index].busy == false);
              if (false == nrf52_dma_flag )
                {
                  if (OK != nrf52_rw_request(priv, &priv->eplist[epno_index]))
                    {
                      uwarn("No Buffer to receiver more data.\n");
                    }

                  /* clear epout to make sure the next epdata event */
                  nrf52_usbd_transfer_out_drop(epno);
                }
              else
                {
                  uwarn("\t\t There is DMA transferring in progress.\n");
                }
            }
          epout_mask <<= 1;
        }
    }

  /* handle reset | resume | suspend */
  nrf52_usbd_isr_handle();

  usbtrace(TRACE_INTEXIT(NRF52_TRACEINTID_EPINTERRUPT), 0);

  return OK;
}


/****************************************************************************
 * Suspend/Resume Helpers
 ****************************************************************************/
/****************************************************************************
 * Name: nrf52_suspend
 ****************************************************************************/

static void nrf52_suspend(struct nrf52_usbdev_s *priv)
{

  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

  /* If we are not a self-powered device, the got to low-power mode */
  if (false == priv->selfpowered)
    {
      priv->phystatus = NRF52_USBPHY_STATUS_SUSPEND;

      nrf_usbd_lowpower_enable();

      nrf52_setimask(priv, NRF_USBD_EVENT_SOF, 0);

      if (nrfx_usbd_errata_171())
        {
          if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
            {
              *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
              *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
              *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
            }
          else
            {
              *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
            }
        }
    }

}

/****************************************************************************
 * Name: nrf52_initresume
 * self_wakeup : if this wakeup is generated by perph or host
 ****************************************************************************/

static void nrf52_initresume(struct nrf52_usbdev_s *priv, bool self_wakeup)
{
  /* This function is called when either (1) a WKUP interrupt is received from
   * the host PC, or (2) the class device implementation calls the wakeup()
   * method.
   */
  /* Clear the USB low power mode (lower power mode was not set if this is
   * a self-powered device. ).
   */
  if (false == priv->selfpowered)
    {
      priv->phystatus = NRF52_USBPHY_STATUS_RESUME;

      nrf_usbd_lowpower_disable();
      if (nrfx_usbd_errata_171())
        {
          if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
            {
              *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
              *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
              *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
            }
          else
            {
              *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
            }
        }
    }

  /* Restore full power -- whatever that means for this particular board */
  if (self_wakeup)
    {
      /*
       * The remote wakeup device must hold the resume signaling for at
       * least 1 ms but for no more than 15 ms (TDRSMUP).
       * At the end of this period, the device stops driving the bus
       * (puts its drivers into the high-impedance state and
       * does not drive the bus to the J state).
       */
      nrf_usbd_dpdmvalue_set(NRF_USBD_DPDMVALUE_RESUME);
      nrf_usbd_task_trigger(NRF_USBD_TASK_DRIVEDPDM);
      up_udelay(1000);
      nrf_usbd_task_trigger(NRF_USBD_TASK_NODRIVEDPDM);
    }

  /* Notify the class driver of the resume event */

  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: nrf52_esofpoll
 ****************************************************************************/

static void nrf52_esofpoll(struct nrf52_usbdev_s *priv)
{

  /* Called periodically from ESOF interrupt after RSMSTATE_STARTED */

  switch (priv->rsmstate)
    {
      /* One ESOF after internal resume requested */

      case RSMSTATE_STARTED:
        priv->rsmstate = RSMSTATE_WAITING;
        priv->nesofs   = 2;
        break;

      /* Countdown before completing the operation */

      case RSMSTATE_WAITING:
        priv->nesofs--;
        if (priv->nesofs == 0)
          {
            /* Okay.. we are ready to resume normal operation */

            priv->rsmstate = RSMSTATE_IDLE;

