redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
            /* Disable ESOF polling, disable the SUSP interrupt, and enable
             * the WKUP interrupt.  Clear any pending WKUP interrupt.
             */

            nrf52_setimask(priv, 0, NRF_USBD_INT_SOF_MASK);
          }
        break;

      case RSMSTATE_IDLE:
      default:
        priv->rsmstate = RSMSTATE_IDLE;
        break;
    }
}

/****************************************************************************
 * Endpoint Helpers
 ****************************************************************************/


/****************************************************************************
 * Name: nrf52_epreserved
 ****************************************************************************/

static inline bool nrf52_epreserved(struct nrf52_usbdev_s *priv, int epno)
{
  return ((priv->epavail & NRF52_ENDP_BIT(epno)) == 0);
}


/****************************************************************************
 * Endpoint operations
 ****************************************************************************/
/****************************************************************************
 * Name: nrf52_epconfigure
 ****************************************************************************/

static int nrf52_epconfigure(struct usbdev_ep_s *ep,
                             const struct usb_epdesc_s *desc,
                             bool last)
{
  struct nrf52_ep_s *privep = (struct nrf52_ep_s *)ep;
  uint16_t maxpacket;
  uint8_t  epno;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !desc)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: ep=%p desc=%p\n");
      return -EINVAL;
    }
#endif

  /* Get the unadorned endpoint address */

  epno = USB_EPNO(desc->addr);
  usbtrace(TRACE_EPCONFIGURE, (uint16_t)epno);
  DEBUGASSERT(epno == USB_EPNO(ep->eplog));

  flags = enter_critical_section();

  /* Set the requested type */

  privep->eptype = desc->attr;

  /* Get the maxpacket size of the endpoint. */

  maxpacket = GETUINT16(desc->mxpacketsize);
  DEBUGASSERT(maxpacket <= NRF52_MAXPACKET_SIZE);
  ep->maxpacket = maxpacket;

  /* Get the subset matching the requested direction */

  ep->eplog = desc->addr;

  nrf_usbd_ep_enable(ep->eplog);

  if (USB_ISEPOUT(ep->eplog))
    {
      nrf52_usbd_transfer_out_drop(ep->eplog);
    }

  /* check toggle status and force to DATA0 and un-stall */
  if (nrf_usbd_dtoggle_get(desc->addr) != NRF_USBD_DTOGGLE_DATA0)
    {
      nrf_usbd_dtoggle_set(desc->addr, NRF_USBD_DTOGGLE_DATA0);
    }

  if (NRF_USBD_EPISO_CHECK(desc->addr) == false)
    {
      nrf_usbd_ep_unstall(desc->addr);
    }

  privep->stalled = false;

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: nrf52_epdisable
 ****************************************************************************/

static int nrf52_epdisable(struct usbdev_ep_s *ep)
{
  struct nrf52_ep_s *privep = (struct nrf52_ep_s *)ep;
  nrf_usbd_int_mask_t int_mask = 0;
  irqstate_t flags;
  uint8_t epno;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: ep=%p\n", ep);
      return -EINVAL;
    }
#endif

  epno = USB_EPNO(ep->eplog);
  usbtrace(TRACE_EPDISABLE, epno);

  /* Cancel any ongoing activity */

  flags = enter_critical_section();

#if 0
  /* Disable TX or RX */

  nrf_usbd_ep_disable(epno | USB_DIR_OUT);
  nrf_usbd_ep_disable(epno | USB_DIR_IN);

  int_mask = 1 << (USBD_INTEN_ENDEPOUT0_Pos + epno);

#else
  nrf_usbd_ep_disable(ep->eplog);
#endif

  nrf52_cancelrequests(privep);

  if (USB_ISEPIN(ep->eplog))
    {
      if (epno == EPISOC )
        {
          int_mask |= NRF_USBD_INT_ENDISOIN0_MASK;
        }
      else
        {
          int_mask |= 1 << (USBD_INTEN_ENDEPIN0_Pos + epno);
        }
    }
  else
    {
      int_mask |= 1 << (USBD_INTEN_ENDEPOUT0_Pos + epno);
    }

  nrf52_setimask(privep->dev, 0, int_mask);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: nrf52_epallocreq
 ****************************************************************************/

static struct usbdev_req_s *nrf52_epallocreq(struct usbdev_ep_s *ep)
{
  struct nrf52_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif
  usbtrace(TRACE_EPALLOCREQ, USB_EPNO(ep->eplog));

  privreq = (struct nrf52_req_s *)kmm_malloc(sizeof(struct nrf52_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  memset(privreq, 0, sizeof(struct nrf52_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: nrf52_epfreereq
 ****************************************************************************/

static void nrf52_epfreereq(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct nrf52_req_s *privreq = (struct nrf52_req_s *)req;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif
  usbtrace(TRACE_EPFREEREQ, USB_EPNO(ep->eplog));

  kmm_free(privreq);
}

/****************************************************************************
 * Name: nrf52_epallocbuffer
 *
 * Description:
 *   Allocate an I/O buffer
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_DMA
static void *nrf52_epallocbuffer(FAR struct usbdev_ep_s *ep, uint16_t bytes)
{
  uint32_t buffer;
  usbtrace(TRACE_EPALLOCBUFFER, ep->eplog);

  /* Bulk / Interrupt / ISO transfer request the memory should be 4 byte aligned */

  buffer = (uint32_t)kmm_malloc(bytes);

  if (buffer & 0x3)
    {
      usbtrace(TRACE_EPALLOCBUFFER, 0xFF);
      assert(0);
    }

  return (void *)buffer;
}

/****************************************************************************
 * Name: nrf52_epfreebuffer
 *
 * Description:
 *   Free an I/O buffer
 *
 ****************************************************************************/

static void nrf52_epfreebuffer(FAR struct usbdev_ep_s *ep, FAR void *buf)
{
  usbtrace(TRACE_EPFREEBUFFER, ep->eplog);

  kmm_free(buf);
}
#endif

/****************************************************************************
 * Name: nrf52_epsubmit
 ****************************************************************************/

static int nrf52_epsubmit(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct nrf52_req_s *privreq = (struct nrf52_req_s *)req;
  struct nrf52_ep_s *privep = (struct nrf52_ep_s *)ep;
  struct nrf52_usbdev_s *priv;
  irqstate_t flags;
  uint8_t epno;
  int ret = OK;

#ifdef CONFIG_DEBUG_FEATURES
  if (!req || !req->callback || !req->buf || !ep)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: req=%p callback=%p buf=%p ep=%p\n",
           req, req->callback, req->buf, ep);
      return -EINVAL;
    }
#endif

