redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
  usbtrace(TRACE_EPSUBMIT, ep->eplog);
  priv = privep->dev;

  if (!priv->driver)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_NOTCONFIGURED), priv->usbdev.speed);
      uerr("ERROR: driver=%p\n", priv->driver);
      return -ESHUTDOWN;
    }

  /* Handle the request from the class driver */

  epno        = USB_EPNO(ep->eplog);

  flags       = enter_critical_section();

  req->result = -EINPROGRESS;
  req->xfrd   = 0;
  /* If we are stalled, then drop all requests on the floor */

  if (privep->stalled)
    {
      nrf52_abortrequest(privep, privreq, -EBUSY);
      uerr("ERROR: stalled\n");
      ret = -EBUSY;
    }
  else if (EP0 == epno)
    {
      if (true == priv->ep0dir)
        {
          nrf52_rqenqueue(privep, privreq);
          ret = nrf52_wrrequest_ep0(priv, privep);
        }
      else
        {
          /* NOTE: Data values or size may be tested here to decide if clear or stall.
           * If errata 154 is present the data transfer is acknowledged by the hardware. */
          /* send out Status Stage */
          if (false == nrfx_usbd_errata_154())
            {
              nrf52_trace("EP0 OUT Status traction.\n");

              nrf52_ep0setup_status();
            }
          priv->ep0state = EP0STATE_IDLE;

          nrf52_trace("EP0 OUT traction.\n");
          return ret;
        }
    }
  else if (USB_ISEPIN(ep->eplog))
    {
      /* Handle IN (device-to-host) requests. */
      /* Add the new request to the request queue for the IN endpoint */

      nrf52_rqenqueue(privep, privreq);
      usbtrace(TRACE_INREQQUEUED(epno), req->len);

      /* If the IN endpoint FIFO is available, then transfer the data now */

      if ((!privep->busy ) && (false == nrf52_dma_flag))
        {
          ret = nrf52_rw_request(priv, privep);
        }
    }
  else
    {
      /* Handle OUT (host-to-device) requests */
      /* Add the new request to the request queue for the OUT endpoint */

      privep->txnullpkt = 0;
      bool req_list_empty = sq_empty(privep);

      nrf52_rqenqueue(privep, privreq);

      if (req_list_empty)
        {
          nrf52_usbd_transfer_out_drop(ep->eplog);
        }

      usbtrace(TRACE_OUTREQQUEUED(epno), ep->eplog);
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: nrf52_epcancel
 ****************************************************************************/

static int nrf52_epcancel(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct nrf52_ep_s *privep = (struct nrf52_ep_s *)ep;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_USB
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif
  usbtrace(TRACE_EPCANCEL, USB_EPNO(ep->eplog));

  flags = enter_critical_section();
  nrf52_cancelrequests(privep);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: nrf52_epstall
 ****************************************************************************/

static int nrf52_epstall(struct usbdev_ep_s *ep, bool resume)
{
  struct nrf52_ep_s *privep;
  struct nrf52_usbdev_s *priv;
  uint16_t status;
  irqstate_t flags;

#ifdef CONFIG_DEBUG_USB
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  privep = (struct nrf52_ep_s *)ep;
  priv   = (struct nrf52_usbdev_s *)privep->dev;

  /* STALL or RESUME the endpoint */

  flags = enter_critical_section();
  usbtrace(resume ? TRACE_EPRESUME : TRACE_EPSTALL, USB_EPNO(ep->eplog));

  /* Get status of the endpoint; stall the request if the endpoint is
   * disabled
   */

  status = nrf_usbd_ep_enable_check(ep->eplog);

  /* Handle the resume condition */

  if (resume)
    {
      /* Resuming a stalled endpoint */

      usbtrace(TRACE_EPRESUME, ep->eplog);
      privep->stalled = false;

      if (USB_ISEPOUT(ep->eplog))
        {
          nrf52_usbd_transfer_out_drop(ep->eplog);
        }

      nrf_usbd_ep_unstall(ep->eplog);

      if (USB_ISEPIN(ep->eplog))
        {
          if (status && (false == privep->busy))
            {
              /* Restart any queued write requests */

              if (USB_EPNO(ep->eplog) == EP0)
                {
                  (void)nrf52_wrrequest_ep0(priv, privep);
                }
              else
                {
                  (void)nrf52_rw_request(priv, privep);
                }
            }
        }
    }

  /* Handle the stall condition */

  else
    {
      usbtrace(TRACE_EPSTALL, ep->eplog);
      privep->stalled = true;

      nrf_usbd_ep_stall(ep->eplog);
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Device Controller Operations
 ****************************************************************************/
/****************************************************************************
 * Name: nrf52_allocep
 ****************************************************************************/
static uint8_t nrf52_eplog2index(uint8_t eplog)
{
  /* they are spitted into 9 end point group
   * 0,1 | 1,2 | 3,4 | 5,6 | 7,8 |......
   * EP0 | EP1 | EP2 | EP3 | EP4 |......
   * convert logic epno to internal eplist index
   */
  uint8_t index;

  index = USB_EPNO(eplog) * 2;
  if (USB_ISEPIN(eplog))
    {
      index += 1;
    }

  return index;
}

static uint8_t nrf52_index2eplog(uint8_t index)
{
  /* they are spitted into 9 end point group
   * 0,1 | 1,2 | 3,4 | 5,6 | 7,8 |......
   * EP0 | EP1 | EP2 | EP3 | EP4 |......
   * convert internal eplist index to logic epno
   */
  uint8_t eplog;

  eplog = index / 2;
  if (index % 2)
    {
      eplog |= USB_DIR_IN;
    }

  return eplog;
}

static struct usbdev_ep_s *nrf52_allocep(struct usbdev_s *dev, uint8_t epno,
                                         bool in, uint8_t eptype)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)dev;
  struct nrf52_ep_s *privep = NULL;
  uint16_t epset;
  irqstate_t irq_flag;
  int  index;

