redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
  usbtrace(TRACE_DEVALLOCEP, (uint16_t)epno);
#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif

  /* Ignore any direction bits in the logical address */

  index = nrf52_eplog2index(epno);
  epno = USB_EPNO(epno);

  ASSERT(epno > 0);


  /* A logical address of 0 means that any endpoint will do */

  if (index > 0)
    {
      /* Otherwise, we will return the endpoint structure only for the requested
       * 'logical' endpoint.  All of the other checks will still be performed.
       *
       * First, verify that the logical endpoint is in the range supported by
       * by the hardware.
       */

      if (index >= NRF52_NENDPOINTS)
        {
          usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_BADEPNO), (uint16_t)index);
          return NULL;
        }

      /* Convert the logical address to a physical OUT endpoint address and
       * remove all of the candidate endpoints from the bitset except for the
       * the IN/OUT pair for this logical address.
       */

      epset = NRF52_ENDP_BIT(index);
    }

  /* Check if the selected endpoint number is available */

  irq_flag = enter_critical_section();
  if (priv->epavail & epset)
    {
      priv->epavail &= ~epset;
      privep = &priv->eplist[index];
    }
  else
    {
      ASSERT(0);
    }
  leave_critical_section(irq_flag);

  if (!privep)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_EPRESERVE), (uint16_t)epset);
      return NULL;
    }

  privep->eptype = eptype;
  privep->ep.eplog = epno;

  return &privep->ep;

}


/****************************************************************************
 * Name: nrf52_freeep
 ****************************************************************************/

static void nrf52_freeep(struct usbdev_s *dev, struct usbdev_ep_s *ep)
{
  struct nrf52_usbdev_s *priv;
  struct nrf52_ep_s *privep;

#ifdef CONFIG_DEBUG_USB
  if (!dev || !ep)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif
  priv   = (struct nrf52_usbdev_s *)dev;
  privep = (struct nrf52_ep_s *)ep;
  usbtrace(TRACE_DEVFREEEP, (uint16_t)USB_EPNO(ep->eplog));

  if (priv && privep)
    {

      /* Mark the endpoint as available */

      irqstate_t irq_flag = enter_critical_section();
      priv->epavail |= NRF52_ENDP_BIT(nrf52_eplog2index(privep->ep.eplog));
      leave_critical_section(irq_flag);

    }
}

/****************************************************************************
 * Name: nrf52_pullup
 *
 * Description:
 *   Software-controlled connect to/disconnect from USB host
 *
 ****************************************************************************/

static int nrf52_pullup(struct usbdev_s *dev, bool enable)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)dev;

  usbtrace(TRACE_DEVPULLUP, (uint16_t)enable);

  if (priv->phystatus >= NRF52_USBPHY_STATUS_PWR_READY)
    {
      if (enable)
        {
          priv->connect = NRF52_DEV_CONNECTED;
          nrf_usbd_pullup_enable();
        }
      else
        {
          priv->connect = NRF52_DEV_DISCONNECT;
          nrf_usbd_pullup_disable();
        }
    }
  else
    {
      if (enable)
        {
          /* pwr is not ready , put into connecting status */
          priv->connect = NRF52_DEV_CONNECTING;
        }
      else
        {
          nrf_usbd_pullup_disable();
          priv->connect = NRF52_DEV_DISCONNECT;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: nrf52_getframe
 ****************************************************************************/

static int nrf52_getframe(struct usbdev_s *dev)
{
  int framecnt;
#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Return the last frame number detected by the hardware
   * there is no implement , if using , should do in further
   */

  framecnt = nrf_usbd_framecntr_get();

  usbtrace(TRACE_DEVGETFRAME, framecnt);

  return framecnt;
}

/****************************************************************************
 * Name: nrf52_wakeup
 ****************************************************************************/

static int nrf52_wakeup(struct usbdev_s *dev)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)dev;
  irqstate_t flags;

  usbtrace(TRACE_DEVWAKEUP, 0);
#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Start the resume sequence.  The actual resume steps will be driven
   * by the ESOF interrupt and .
   */

  flags = enter_critical_section();
  nrf52_initresume(priv, true);
  priv->rsmstate = RSMSTATE_STARTED;

  nrf52_setimask(priv, NRF_USBD_INT_SOF_MASK | NRF_USBD_INT_USBEVENT_MASK, 0);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: nrf52_selfpowered
 ****************************************************************************/

static int nrf52_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Initialization/Reset
 ****************************************************************************/
static void nrf52_usbd_event_clear_all(void)
{
  for (int event = NRF_USBD_EVENT_USBRESET; event <= NRF_USBD_EVENT_ACCESSFAULT ; event += 4)
    {
      nrf_usbd_event_clear(event);
    }
}
/****************************************************************************
 * Name: nrf52_reset
 ****************************************************************************/

