redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
static void nrf52_reset(struct nrf52_usbdev_s *priv, bool hwreset)
{
  int epno;

  /* Reset endpoints */

  for (epno = 0; epno < NRF52_NENDPOINTS; epno++)
    {
      struct nrf52_ep_s *privep = &priv->eplist[epno];

      /* Cancel any queued requests.  Since they are canceled
       * with status -ESHUTDOWN, then will not be requeued
       * until the configuration is reset.  NOTE:  This should
       * not be necessary... the CLASS_DISCONNECT above should
       * result in the class implementation calling nrf52_epdisable
       * for each of its configured endpoints.
       */

      nrf52_cancelrequests(privep);

      /* Reset endpoint status */

      privep->stalled   = false;
      privep->busy      = false;
      privep->txnullpkt = false;
    }

  /* Tell the class driver that we are disconnected.  The class driver
   * should then accept any new configurations.
   */
  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }
  /* Re-configure the USB controller in its initial, unconnected state */

  if (hwreset)
    {
      nrf52_hwreset(priv);
    }

  /* Reset the device state structure */

  priv->ep0state  = EP0STATE_IDLE;
  priv->rsmstate  = RSMSTATE_IDLE;

  priv->usbdev.speed = USB_SPEED_FULL;
}

/****************************************************************************
 * Name: nrf52_hwreset
 ****************************************************************************/

static void nrf52_hwreset(struct nrf52_usbdev_s *priv)
{
  /* Put the USB controller into reset, clear all interrupt enables */

  irqstate_t flags;

  flags = enter_critical_section();

  /* Disable interrupts (and perhaps take the USB controller out of reset) */

  priv->imask = 0;
  nrf_usbd_int_disable(NRF52_USBD_INT_ALL_MASK);

  /* Clear any pending interrupts */
  nrf52_usbd_event_clear_all();

  /* Enable interrupts at the USB controller */

  nrf52_setimask(priv, NRF52_DEFAULT_INT, 0);
  leave_critical_section(flags);
  return;
}

static void nrf52_usbd_enable(void)
{
  irqstate_t flags;

  flags = enter_critical_section();
  /* Prepare for READY event receiving */
  nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK \
                            | NRF_USBD_EVENTCAUSE_SUSPEND_MASK \
                            | NRF_USBD_EVENTCAUSE_RESUME_MASK);

  if (nrfx_usbd_errata_187())
    {
      if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
          *((volatile uint32_t *)(0x4006ED14)) = 0x00000003;
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
      else
        {
          *((volatile uint32_t *)(0x4006ED14)) = 0x00000003;
        }
    }

  if (nrfx_usbd_errata_171())
    {
      if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
          *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
      else
        {
          *((volatile uint32_t *)(0x4006EC14)) = 0x000000C0;
        }
    }

  nrf_usbd_enable();
  /* Waiting for peripheral to enable, this should take a few us */
  while (0 == (NRF_USBD_EVENTCAUSE_READY_MASK & nrf_usbd_eventcause_get()))
    {
      /* Empty loop */
    }
  nrf_usbd_eventcause_clear(NRF_USBD_EVENTCAUSE_READY_MASK);

  if (nrfx_usbd_errata_171() || nrfx_usbd_errata_187())
    {
      if (*((volatile uint32_t *)(0x4006EC00)) == 0x00000000)
        {
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
          *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
          *((volatile uint32_t *)(0x4006EC00)) = 0x00009375;
        }
      else
        {
          *((volatile uint32_t *)(0x4006EC14)) = 0x00000000;
        }

    }

  if (nrfx_usbd_errata_166())
    {
      *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7E3;
      *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = 0x40;
      ARM_ISB();
      ARM_DSB();
    }

  nrf_usbd_isosplit_set(NRF_USBD_ISOSPLIT_Half);

  nrf52_usbd_dma_pending_clear();

  leave_critical_section(flags);
  return;
}

static int nrf52_usbd_disable(void)
{
  irqstate_t flags;

  flags = enter_critical_section();

  nrf52_pullup((struct usbdev_s *)&g_usbddev, false);

  nrf_usbd_disable();

  nrf52_usbd_dma_pending_clear();

  leave_critical_section(flags);

  return OK;

}

/****************************************************************************
 * Name: nrf52_hwsetup
 ****************************************************************************/

static void nrf52_hwsetup(struct nrf52_usbdev_s *priv)
{
  int epno;

  /* Power the USB controller, put the USB controller into reset, disable
   * all USB interrupts
   */

  nrf52_usbd_disable();

  /* Initialize the device state structure.  NOTE: many fields
   * have the initial value of zero and, hence, are not explicitly
   * initialized here.
   */

  memset(priv, 0, sizeof(struct nrf52_usbdev_s));
  priv->epstatus     = NRF52_EP_STATUS_IDLE;
  priv->usbdev.ops   = &g_devops;
  priv->usbdev.ep0   = &priv->eplist[EP0_IN].ep;
  priv->epavail      = NRF52_ENDP_ALLSET & (~ NRF52_ENDP_BIT(EP0_IN)) & (~ NRF52_ENDP_BIT(EP0_OUT));

  /* Initialize the endpoint list */

  for (epno = 0; epno < NRF52_NENDPOINTS; epno++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the (physical) endpoint number which is just the index to the
       * endpoint.
       */

      priv->eplist[epno].ep.ops = &g_epops;
      priv->eplist[epno].dev    = priv;
      priv->eplist[epno].eppos  = epno;
      priv->eplist[epno].ep.eplog = nrf52_index2eplog(epno);

      /* We will use a fixed maxpacket size for all endpoints (perhaps
       * ISOC endpoints could have larger maxpacket???).  A smaller
       * packet size can be selected when the endpoint is configured.
       */

      priv->eplist[epno].ep.maxpacket = NRF52_MAXPACKET_SIZE;
    }

  /* Select a smaller endpoint size for EP0 & bigger size for ISOC */

