redorca/Zeus/nuttx/arch/arm/src/nrf52/nrf52_usbdev.c
#if NRF52_EP0MAXPACKET < NRF52_MAXPACKET_SIZE
  priv->eplist[EP0_IN].ep.maxpacket  = NRF52_EP0MAXPACKET;
  priv->eplist[EP0_OUT].ep.maxpacket = NRF52_EP0MAXPACKET;
#endif
  priv->eplist[EPISOC * 2].ep.maxpacket   = NRF52_EP8MAXPACKET;
  priv->eplist[EPISOC * 2 + 1].ep.maxpacket = NRF52_EP8MAXPACKET;

  priv->phystatus = NRF52_USBPHY_STATUS_INITIALIZED;
}

/****************************************************************************
 * Name: nrf52_hwshutdown
 ****************************************************************************/

static void nrf52_hwshutdown(struct nrf52_usbdev_s *priv)
{
  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable all interrupts and force the USB controller into reset */

  nrf_usbd_int_disable(NRF52_USBD_INT_ALL_MASK);

  /* Clear any pending interrupts */

  nrf52_usbd_event_clear_all();

  /* Power down the USB controller */

  nrf52_usbd_disable();

  priv->phystatus = NRF52_USBPHY_STATUS_UNINIT;
}

static void nrf52_usbd_callback(uint32_t power_status)
{
  struct nrf52_usbdev_s *priv = (struct nrf52_usbdev_s *)&g_usbddev;
  /* Enable USBD after VBUS has been detected only */

  if (priv->phystatus != NRF52_USBPHY_STATUS_UNINIT)
    {
      sem_post(&priv->sem);
    }
}

/* monitor usb phy status change
 *
 */
static int nrf52_usbd_monitor(int argc, char **argv)
{
  struct nrf52_usbdev_s *priv = &g_usbddev;
  uint32_t pwr_status;
  while (1)
    {
      sem_wait(&priv->sem);
      pwr_status = nrf52_power_get_usbphy_status();

      _warn("phystatus %d, pwr_status : %d.\n", priv->phystatus, pwr_status);
      switch (priv->phystatus)
        {
          case NRF52_USBPHY_STATUS_RESUME:
          case NRF52_USBPHY_STATUS_SUSPEND:
            if (pwr_status == NRF52_POWER_USBD_REMOVE)
              {
                priv->phystatus = NRF52_USBPHY_STATUS_REMOVE;
                nrf52_usbd_disable();
              }
            break;
          case NRF52_USBPHY_STATUS_INITIALIZED:
          case NRF52_USBPHY_STATUS_DETECT:
          case NRF52_USBPHY_STATUS_PWR_READY:
            if (pwr_status == NRF52_POWER_USBD_PWRRDY)
              {
                priv->phystatus = NRF52_USBPHY_STATUS_PWR_READY;
                {
                  nrf52_pullup((struct usbdev_s *)priv, true);
                }
              }
            else if (pwr_status == NRF52_POWER_USBD_REMOVE)
              {
                nrf52_reset(priv, true);
                nrf52_usbd_disable();
                priv->phystatus = NRF52_USBPHY_STATUS_REMOVE;
              }
            else if (pwr_status == NRF52_POWER_USBD_DETECT)
              {
                nrf52_usbd_enable();

                priv->phystatus = NRF52_USBPHY_STATUS_DETECT;
              }
            break;
          case NRF52_USBPHY_STATUS_REMOVE:
            if (pwr_status == NRF52_POWER_USBD_DETECT)
              {
                nrf52_usbd_enable();
                priv->phystatus = NRF52_USBPHY_STATUS_DETECT;
              }
          case NRF52_USBPHY_STATUS_UNINIT:
            break;
        }
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
/****************************************************************************
 * Name: up_usbinitialize
 * Description:
 *   Initialize the USB driver
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
void up_usbinitialize(void)
{
  /* For now there is only one USB controller, but we will always refer to
   * it using a pointer to make any future ports to multiple USB controllers
   * easier.
   */

  struct nrf52_usbdev_s *priv = &g_usbddev;

  usbtrace(TRACE_DEVINIT, 0);

  sem_init(&priv->sem, 0, 0);

  /* Power up the USB controller, but leave it in the reset state */

  nrf52_hwsetup(priv);

  nrf52_clock_hsclk_start();

  /* Attach USB controller interrupt handlers.  The hardware will not be
   * initialized and interrupts will not be enabled until the class device
   * driver is bound.  Getting the IRQs here only makes sure that we have
   * them when we need them later.
   */

  if (irq_attach(USBD_IRQn, nrf52_usbd_interrupt, NULL) != 0)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_IRQREGISTRATION),
               (uint16_t)USBD_IRQn);
      goto errout;
    }

  /* Reset/Re-initialize the USB hardware */

  nrf52_reset(priv, true);

  nrf52_power_initlialize();

  nrf52_power_register_callback(nrf52_usbd_callback, POWER_CALLBACK_USBD);

  return;

errout:
  up_usbuninitialize();
}

/****************************************************************************
 * Name: up_usbuninitialize
 * Description:
 *   Initialize the USB driver
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void up_usbuninitialize(void)
{
  /* For now there is only one USB controller, but we will always refer to
   * it using a pointer to make any future ports to multiple USB controllers
   * easier.
   */

  struct nrf52_usbdev_s *priv = &g_usbddev;
  irqstate_t flags;

  flags = enter_critical_section();
  usbtrace(TRACE_DEVUNINIT, 0);

  /* Disable and detach the USB IRQs */

  up_disable_irq(USBD_IRQn);
  irq_detach(USBD_IRQn);
  nrf52_power_register_callback(NULL, POWER_CALLBACK_USBD);

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(NRF52_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
    }

  /* Put the hardware in an inactive state */

  nrf52_hwshutdown(priv);

  sem_destroy(&priv->sem);

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: usbdev_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's bind() method will be
 *   called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  /* For now there is only one USB controller, but we will always refer to
   * it using a pointer to make any future ports to multiple USB controllers
   * easier.
   */

